In [1]:
import pandas as pd ; import numpy as np

In [5]:
    s=pd.Series(["ege",np.nan,"ali","eda"])
    s

0    ege
1    NaN
2    ali
3    eda
dtype: object

In [6]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [7]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [9]:
s[3]=None

In [10]:
s

0     ege
1     NaN
2     ali
3    None
dtype: object

In [11]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [12]:
s.dropna()

0    ege
2    ali
dtype: object

In [13]:
s

0     ege
1     NaN
2     ali
3    None
dtype: object

In [14]:
s[s.notnull()]

0    ege
2    ali
dtype: object

In [15]:
s

0     ege
1     NaN
2     ali
3    None
dtype: object

In [30]:

df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [31]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [22]:
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [23]:

df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [48]:
df[1]=NA

In [49]:
df

     0   1   2
0  1.0 NaN NaN
1  4.0 NaN NaN
2  NaN NaN NaN

In [50]:
df

     0   1   2
0  1.0 NaN NaN
1  4.0 NaN NaN
2  NaN NaN NaN

In [51]:
df.dropna(axis=1, how="all")

     0
0  1.0
1  4.0
2  NaN

In [52]:
df

     0   1   2
0  1.0 NaN NaN
1  4.0 NaN NaN
2  NaN NaN NaN

In [58]:
df.dropna(thresh=1)

     0   1   2
0  1.0 NaN NaN
1  4.0 NaN NaN

In [59]:
df

     0   1   2
0  1.0 NaN NaN
1  4.0 NaN NaN
2  NaN NaN NaN

In [71]:
df.fillna(0)

     0    1    2
0  1.0  0.0  0.0
1  4.0  0.0  0.0
2  0.0  0.0  0.0

In [76]:
df.fillna({0:15,1:25})

      0     1   2
0   1.0  25.0 NaN
1   4.0  25.0 NaN
2  15.0  25.0 NaN

In [82]:
df.fillna(1:25}, inplace=True)

In [83]:
df

     0    1    2
0  1.0  0.0  0.0
1  4.0  0.0  0.0
2  0.0  0.0  0.0

In [84]:
df

     0    1    2
0  1.0  0.0  0.0
1  4.0  0.0  0.0
2  0.0  0.0  0.0

In [85]:
df[1]=NA

In [86]:
df

     0   1    2
0  1.0 NaN  0.0
1  4.0 NaN  0.0
2  0.0 NaN  0.0

In [88]:
df.fillna({1:25}, inplace=True)

In [89]:
df

     0     1    2
0  1.0  25.0  0.0
1  4.0  25.0  0.0
2  0.0  25.0  0.0

In [90]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [91]:
df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [92]:
df.fillna(method="ffill", limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [93]:
s

0     ege
1     NaN
2     ali
3    None
dtype: object

In [94]:
s=pd.Series(["ege",np.nan,"ali","eda"])

In [95]:
s

0    ege
1    NaN
2    ali
3    eda
dtype: object

In [96]:
veri=pd.Series([1,0,NA,5])

In [97]:
veri

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [98]:
veri.fillna(veri.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [99]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])

In [100]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

In [104]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN